In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('http://bit.ly//drinksbycountry')

In [3]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [4]:
df.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
Africa,61.471698,16.339623,16.264151,3.007547
Asia,37.045455,60.840909,9.068182,2.170455
Europe,193.777778,132.555556,142.222222,8.617778
North America,145.434783,165.739130,24.521739,5.995652
Oceania,89.687500,58.437500,35.625000,3.381250
South America,175.083333,114.750000,62.416667,6.308333

In [5]:
df[df.continent=='Africa'].beer_servings.mean()

61.471698113207545

In [6]:
df.groupby('continent').beer_servings.mean()

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

In [7]:
df.groupby('continent').beer_servings.mean()[0:4]

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Name: beer_servings, dtype: float64

In [8]:
df1 = pd.pivot_table(df,index = 'continent',values = 'beer_servings')

In [9]:
df1

               beer_servings
continent
Africa             61.471698
Asia               37.045455
Europe            193.777778
North America     145.434783
Oceania            89.687500
South America     175.083333

In [10]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [11]:
df2 = pd.pivot_table(df,index = 'continent',values = ['beer_servings','wine_servings'],
                     aggfunc=[np.mean,np.sum,np.std])

In [65]:
df2

                       mean                         sum                \
              beer_servings wine_servings beer_servings wine_servings
continent
Africa            61.471698     16.264151          3258           862
Asia              37.045455      9.068182          1630           399
Europe           193.777778    142.222222          8720          6400
North America    145.434783     24.521739          3345           564
Oceania           89.687500     35.625000          1435           570
South America    175.083333     62.416667          2101           749

                        std
              beer_servings wine_servings
continent
Africa            80.557816     38.846419
Asia              49.469725     21.667034
Europe            99.631569     97.421738
North America     79.621163     28.266378
Oceania           96.641412     64.555790
South America     65.242845     88.620189